{
    "overall": {
        "first": "The Grid domain models a robot navigating between connected locations while collecting keys to unlock locked areas.",
        "detailed-first": "This domain consists of a finite set of interconnected places. The robot can move between places if they are connected, pick up keys, and unlock locked locations whose locks match the shape of the key it carries. The robot starts at one location and must reach a goal location, possibly requiring it to collect and use keys along the way to unlock passages."
    },
    "predicates": {
        "at-robot": {
            "first": "The robot is at a specific place.",
            "detailed-first": "Indicates the robot’s current position within the grid. At any time, the robot can be located at exactly one place."
        },
        "at": {
            "first": "A key is at a specific place.",
            "detailed-first": "Represents that a key is lying at a certain location within the grid. The robot can move to this place to pick up the key."
        },
        "conn": {
            "first": "Two places are connected.",
            "detailed-first": "Defines a bidirectional connection between two places, meaning the robot can move directly between them if no lock blocks the way."
        },
        "locked": {
            "first": "A place is locked.",
            "detailed-first": "Marks a place as locked, preventing the robot from entering until it is unlocked using a matching key."
        },
        "open": {
            "first": "A place is open.",
            "detailed-first": "Indicates that the place is unlocked and accessible for the robot to enter or move through."
        },
        "key-shape": {
            "first": "A key has a particular shape.",
            "detailed-first": "Each key is associated with a shape that determines which locks it can open. Only a key whose shape matches a lock’s shape can unlock that place."
        },
        "lock-shape": {
            "first": "A place’s lock has a particular shape.",
            "detailed-first": "Defines the shape of the lock associated with a specific place. The place can only be unlocked by a key with the same shape."
        },
        "holding": {
            "first": "The robot is holding a key.",
            "detailed-first": "Indicates that the robot is currently carrying a specific key. While holding a key, the robot cannot pick up another one unless it drops the current one."
        },
        "arm-empty": {
            "first": "The robot is not holding anything.",
            "detailed-first": "Shows that the robot’s gripper is empty and can pick up a new key."
        }
    },
    "actions": {
        "move": {
            "first": "The robot moves from one place to another connected place.",
            "detailed-first": "This action represents basic navigation in the grid. The robot can move between two connected places if the destination is open or has been unlocked. The effect is that the robot changes its position to the new place."
        },
        "pickup": {
            "first": "The robot picks up a key.",
            "detailed-first": "If the robot is at a place containing a key and its arm is empty, it can pick up that key. The effect is that the key is now held by the robot and no longer at the place."
        },
        "unlock": {
            "first": "The robot unlocks a locked place using a key.",
            "detailed-first": "If the robot is holding a key whose shape matches a locked place’s lock-shape, it can perform the unlock action. The effect is that the place becomes open and accessible."
        },
        "drop": {
            "first": "The robot drops the key it is holding.",
            "detailed-first": "This action allows the robot to place a held key down at its current location, freeing its gripper for another key."
        }
    }
}
