{
  "overall": {
    "first": "The Bloxorz domain models a block that rolls across a grid of tiles to reach a goal tile.",
    "detailed-first": "This domain operates over a finite set of tiles and a single block. The block can stand upright on one tile or lie flat across two adjacent tiles. It moves by rolling north, south, east, or west according to tile adjacencies. The objective is to roll the block onto the goal tile in its standing position."
  },
  "predicates": {
    "standing-on": {
      "first": "A block stands upright on one tile.",
      "detailed-first": "Indicates that the block is standing vertically on a single tile. In this state, the block occupies only that one position and can roll in any direction to become lying flat."
    },
    "lying-on": {
      "first": "A block lies flat across two tiles.",
      "detailed-first": "Specifies that the block is lying horizontally or vertically, occupying two adjacent tiles at once. Its orientation determines how it can move next."
    },
    "adjacent": {
      "first": "Defines adjacency between tiles in a given direction.",
      "detailed-first": "Establishes the directional neighbor relationship (north, south, east, west) between tiles, enabling legal block movements."
    },
    "perpendicular": {
      "first": "Defines orthogonal directions.",
      "detailed-first": "Used to ensure correct orientation when rolling a lying block perpendicular to its axis."
    }
  },
  "actions": {
    "lay-down": {
      "first": "A standing block rolls in one direction to lie flat across two tiles.",
      "detailed-first": "When the block stands on a tile and two adjacent tiles extend in a direction, it rolls forward, ending up lying flat over those two tiles."
    },
    "stand-up": {
      "first": "A flat block rolls to stand upright on the next tile.",
      "detailed-first": "When the block lies flat and rolls along its long axis, it ends up standing on the next tile."
    },
    "roll": {
      "first": "A flat block rolls sideways while staying flat.",
      "detailed-first": "When the block lies flat across two tiles, it can roll sideways (perpendicular direction) to remain flat across the next two tiles."
    }
  }
}