{
    "creation": "2025-10-13",
    "overall": {
        "first": "The Sudoku 4x4 domain models a puzzle environment where numbers 1 through 4 must be placed in a 4x4 grid according to Sudoku rules.",
        "detailed-first": "This domain represents a simplified Sudoku puzzle where each row, column, and 2x2 box must contain all numbers from 1 to 4 without repetition. The planner must assign numbers to empty cells while ensuring that no conflicts arise. The goal is to fill all cells correctly, respecting Sudoku constraints."
    },
    "predicates": {
        "empty": {
            "first": "The cell is empty.",
            "detailed-first": "This predicate indicates that the specified cell currently has no number assigned. It is a prerequisite for assigning a number to that cell. It is mutually exclusive with 'filled'."
        },
        "filled": {
            "first": "The cell is filled.",
            "detailed-first": "This predicate shows that a particular cell already has a number assigned, meaning it can no longer be changed. It is mutually exclusive with 'empty'."
        },
        "has-value": {
            "first": "The cell contains a specific number.",
            "detailed-first": "This predicate indicates that the cell is assigned a particular number between 1 and 4. It is used to track the Sudoku grid’s current state. It is mutually exclusive with 'not-has-value' for the same number."
        },
        "not-has-value": {
            "first": "The cell does not contain a specific number.",
            "detailed-first": "This predicate represents the negation of 'has-value', ensuring that a cell does not have a given number. It is mutually exclusive with 'has-value' for consistency."
        },
        "no-conflict": {
            "first": "Placing this number in the cell causes no conflicts.",
            "detailed-first": "This predicate ensures that assigning the given number to the cell does not violate Sudoku constraints — meaning the same number does not already appear in the same row, column, or 2x2 box."
        }
    },
    "actions": {
        "assign": {
            "first": "Assigns a number to an empty cell without creating conflicts.",
            "detailed-first": "This action allows the planner to place a number into a cell that is currently empty. Preconditions ensure the cell is empty, that it doesn’t already have the number, and that placing it would not cause any Sudoku rule violations. The effect marks the cell as filled with the chosen number and updates its value predicates accordingly, including deleting the 'empty' predicate and the corresponding 'not-has-value' for that number to maintain mutual exclusivity."
        }
    }
}