{
    "creation": "2025-10-13",
    "overall": {
        "first": "The Sudoku 4x4 domain models a puzzle environment where numbers 1 through 4 must be placed in a 4x4 grid according to Sudoku rules.",
        "detailed-first": "This domain represents a simplified Sudoku puzzle where each row, column, and 2x2 box must contain all numbers from 1 to 4 without repetition. The planner must assign numbers to empty cells while ensuring that no conflicts arise in the same row, column, or box. The goal is to fill all cells correctly, respecting Sudoku constraints."
    },
    "predicates": {
        "empty": {
            "first": "The cell is empty.",
            "detailed-first": "This predicate indicates that the specified cell currently has no number assigned. It is a prerequisite for assigning a number to that cell."
        },
        "has-value": {
            "first": "The cell contains a number.",
            "detailed-first": "This predicate shows that a particular cell is assigned a specific number. Once a cell has a number, it is no longer empty."
        },
        "same-row": {
            "first": "Two cells are in the same row.",
            "detailed-first": "This predicate indicates that the two specified cells share the same row. It is used in action preconditions to ensure that numbers are not duplicated within a row."
        },
        "same-col": {
            "first": "Two cells are in the same column.",
            "detailed-first": "This predicate indicates that the two specified cells share the same column. It is used in action preconditions to prevent number conflicts in columns."
        },
        "same-box": {
            "first": "Two cells are in the same 2x2 box.",
            "detailed-first": "This predicate indicates that the two specified cells belong to the same 2x2 subgrid. It is used in action preconditions to enforce Sudoku's box constraint."
        }
    },
    "actions": {
        "assign": {
            "first": "Assigns a number to an empty cell.",
            "detailed-first": "This action allows the planner to place a number in a cell that is currently empty. Preconditions ensure the cell is empty and that placing the number does not conflict with any other cell in the same row, column, or 2x2 box. The effect marks the cell as filled with the chosen number and removes the empty status."
        }
    }
}