{
  "overall": {
    "first": "The Hiking domain involves navigating through various terrains, such as flat areas and hills, while avoiding wet locations to reach a destination.",
    "detailed-first": "This domain models a hiking scenario where a hiker travels between adjacent locations. The terrain includes flat and hilly areas, and some locations may be wet, preventing further movement from them. The hiker starts at a specific dry location and must plan a route to the goal, moving only from dry places and choosing appropriate actions to traverse flat or hilly terrain."
  },
  "predicates": {
    "at": {
      "first": "The hiker is at a specific location.",
      "detailed-first": "Indicates the hiker’s current position in the environment. The hiker can only be at one location at a time."
    },
    "isDry": {
      "first": "The location is dry.",
      "detailed-first": "Indicates that the location is dry, allowing the hiker to move from this location. Wet locations cannot be used as starting points for movement."
    },
    "isHill": {
      "first": "The location is a hill.",
      "detailed-first": "Indicates that the location is hilly terrain, which can be climbed by the hiker using the climb action."
    },
    "isFlat": {
      "first": "The location is flat terrain.",
      "detailed-first": "Indicates that the location is flat terrain, suitable for walking using the walk action."
    },
    "adjacent": {
      "first": "The locations are adjacent.",
      "detailed-first": "Specifies that two locations are directly connected, allowing the hiker to move between them."
    }
  },
  "actions": {
    "walk": {
      "first": "Walk to an adjacent flat location.",
      "detailed-first": "This action moves the hiker from a dry location to an adjacent flat location. The hiker must start on dry ground and can only walk onto flat terrain."
    },
    "climb": {
      "first": "Climb to an adjacent hill location.",
      "detailed-first": "This action moves the hiker from a dry location to an adjacent hill. The hiker must begin on a dry location and can climb up to the hilly terrain."
    }
  }
}
